app/views/users/show.html.erb

		<ul>
			<% task.stories.order("complete ASC").each do |story| %>
---
SELECT "stories".* FROM "stories" WHERE ("stories".task_id = 1) ORDER BY complete ASC