app/controllers/stories_controller.rb

  def show
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = 1 LIMIT 1

  def edit
    @story = Story.find(params[:id])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = 10 LIMIT 1

  def create
    @task = Task.find(params[:task_id])
    @story = @task.stories.create(params[:story])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
INSERT INTO "stories" ("due", "created_at", "updated_at", "task_id", "desc", "complete", "title") VALUES (NULL, '2011-03-20 21:24:13.724545', '2011-03-20 21:24:13.724545', NULL, 'User can create and edit settings.', NULL, 'Design')

  def update
    @story = Story.find(params[:id])

    respond_to do |format|
      if @story.update_attributes(params[:story])
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = 10 LIMIT 1
UPDATE "stories" SET "title" = 'Adding Story for Test Edited', "due" = '2011-03-20 21:40:00.000000', "updated_at" = '2011-03-20 21:40:54.721865' WHERE "stories"."id" = 10

  def destroy
    @story = Story.find(params[:id])
    @story.destroy
---
SELECT "stories".* FROM "stories" WHERE "stories"."id" = 1 LIMIT 1
DELETE FROM "stories" WHERE "stories"."id" = 1