app/controllers/tasks_controller.rb

  def show
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1

  def edit
    @task = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 6 LIMIT 1

  def create
    @user = current_user
    @task = @user.tasks.create(params[:task])

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("updated_at", "due", "desc", "user_id", "name", "created_at") VALUES ('2011-03-21 03:59:53.000404', '2011-03-21 03:59:00.000000', 'adsffasdfasdfasdf', 1, 'asdfasdfas', '2011-03-21 03:59:53.000404')
UPDATE "users" SET "updated_at" = '2011-03-20 21:00:26.694746', "last_request_at" = '2011-03-20 21:00:26.694147' WHERE "users"."id" = 3

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "due" = '2011-03-20 20:39:00.000000', "desc" = 'vvsadvasdvasdvasdvasva', "name" = 'adsvasdvads', "updated_at" = '2011-03-20 20:39:17.752629' WHERE "tasks"."id" = 1

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 3 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 3