app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("persistence_token", "failed_login_count", "last_request_at", "email", "login", "login_count", "current_login_at", "current_login_ip", "last_login_ip", "updated_at", "last_login_at", "password_salt", "crypted_password", "created_at") VALUES ('ac2646ba4f270e76796cb980d08ec151ad5f79dc31f9cda97be32de4279d45bf3e4208e938cb6c6c724e6287bea8c18c93cd2f931278e0af677a82bc914addf6', 0, '2011-03-20 19:20:02.461726', 'admin111@admin.com', 'admin11111', 1, '2011-03-20 19:20:02.461583', '127.0.0.1', NULL, '2011-03-20 19:20:02.462090', NULL, 'UcLIAZKZYfqKhfku5Bng', '5b568c68bae92a35677ee7ea74da1d09b22109fde0c7214d38fe916482e70e16488ca6cfc801279b352b2c2eaad80faaac02deaade3060c1b0e50bc0348ceb8d', '2011-03-20 19:20:02.462090')